README.md
```mermaid

flowchart TD

    A["🏢 1. Sistema Legado em Produção"] --> B["🌱 2. Criar Novo Front Blazor<br/>em S3 + CloudFront"]
    B --> C["🔐 3. Integrar Cognito (OIDC)"]
    C --> D["⚡ 4. Criar Novas APIs Serverless<br/>(API Gateway + Lambda)"]
    D --> E["🔀 5. Redirecionar Funcionalidades<br/>Específicas para o Novo Backend"]
    E --> F["🌳 6. Expandir o Novo Sistema<br/>e Estrangular o Legado"]
    F --> G["🛑 7. Desligar o Legado"]


```
